---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
source: html/3e6fe526-15ae-29a0-0f10-ad633ce46c3a.htm
---
# BRepBuilderSurfaceGeometry Members

Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface, including Plane and CylSurf.